## Import Different  Libraries

In [71]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
from scipy import stats
from scipy.stats import shapiro
from numpy.random import randn
from numpy.random import poisson
from numpy.random import seed
from scipy.stats import shapiro
from numpy.random import randn

## Load Built-in Data Set

In [19]:
ship = sns.load_dataset("titanic")
df = sns.load_dataset("titanic")

In [20]:
ship.head

<bound method NDFrame.head of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

### Head Of the Data

In [21]:
ship.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# Summary Of the data Before Data Cleaning/Wrangling

In [22]:
ship.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [23]:
ship.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [24]:
ship.shape

(891, 15)

In [26]:
ship.dropna(subset=["deck"],axis =0 ,inplace=True)

In [27]:
ship.shape

(203, 15)

In [28]:
ship.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [29]:
ship.dropna(subset=['age'],axis=0,inplace=True)

In [31]:
ship.shape

(184, 15)

In [32]:
ship.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [33]:
ship.dropna(subset=["embarked"],axis=0,inplace=True)
ship.dropna(subset=['embark_town'],axis=0,inplace=True)

# Data Completly Cleaned After apply different tachniques

In [34]:
ship.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [35]:
ship.shape

(182, 15)

# Data Summary after data Cleanig

### Huge Difference after data cleaning in the summary

In [37]:
ship.describe()

         survived      pclass         age       sibsp       parch        fare
count  182.000000  182.000000  182.000000  182.000000  182.000000  182.000000
mean     0.675824    1.192308   35.623187    0.467033    0.478022   78.919735
std      0.469357    0.516411   15.671615    0.645007    0.755869   76.490774
min      0.000000    1.000000    0.920000    0.000000    0.000000    0.000000
25%      0.000000    1.000000   24.000000    0.000000    0.000000   29.700000
50%      1.000000    1.000000   36.000000    0.000000    0.000000   57.000000
75%      1.000000    1.000000   47.750000    1.000000    1.000000   90.000000
max      1.000000    3.000000   80.000000    3.000000    4.000000  512.329200

In [38]:
ship.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [39]:
ship.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

## T-Test -Performing Hypothesis Testing With Python

### One sample t-test

In [53]:
minimum_age = ship.min()
print(minimum_age)

survived               0
pclass                 1
sex               female
age                 0.92
sibsp                  0
parch                  0
fare                 0.0
embarked               C
who                child
adult_male         False
embark_town    Cherbourg
alive                 no
alone              False
dtype: object

/var/folders/dv/08jm7_lj52sfgs2gsqg7rn1m0000gp/T/ipykernel_40025/1303183162.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  minimum_age = ship.min()

In [55]:
min_age = 16
t_value,p_value=stats.ttest_1samp(ship['age'],min_age)

In [65]:


one_tailed_p_value= p_value/2 # Since alternative hypothesis is one tailed, We need to divide the p value by 2.

print('Test statistic is %f'%float("{:.6f}".format(t_value)))

print('p-value for one tailed test is ', one_tailed_p_value)

Test statistic is 16.892404
p-value for one tailed test is  2.3869365295679547e-39

## Two sample t-test

In [41]:
t_value,p_value=stats.ttest_ind(ship['age'],ship["fare"])

In [48]:
print('Test statistic is %f'%float("{:.6f}".format(t_value)))

print('p-value for two tailed test is ',p_value)

Test statistic is -7.480849
p-value for two tailed test is  5.64656168773021e-13

## Paired t-test

In [66]:
t_value,p_value=stats.ttest_rel(ship['age'],ship['fare'])

one_tailed_p_value=p_value/2

In [67]:


print('Test statistic is %f'%float("{:.6f}".format(t_value)))

print('p-value for one_tailed_test is' ,one_tailed_p_value)

Test statistic is -7.350858
p-value for one_tailed_test is 3.277016949001121e-12

# Shapiro-Wilk test on the normally distributed sample

In [69]:
 #Create data
gfg_data = randn(500)
  
# conduct the  Shapiro-Wilk Test
shapiro(gfg_data)

ShapiroResult(statistic=0.9976468086242676, pvalue=0.7128790616989136)

## Shapiro-Wilk test on not normally distributed sample

In [72]:
seed(0)
# Create data
gfg_data = poisson(5, 200)
  
# conduct the  Shapiro-Wilk Test
shapiro(gfg_data)

ShapiroResult(statistic=0.966901957988739, pvalue=0.00011927181185455993)

## Shapiro-Wilk test on the Titanic Data Set

In [70]:
shapiro(ship['age'])

ShapiroResult(statistic=0.9906661510467529, pvalue=0.28414419293403625)

## Levene’s test

In [77]:
from scipy.stats import levene
# define groups
group_1 = [14, 34, 16, 43, 45, 36, 42, 43, 16, 27]
group_2 = [34, 36, 44, 18, 42, 39, 16, 35, 15, 33]

# define alpha
alpha =0.05
# now we pass the groups and center value from the following
# ('trimmed mean', 'mean', 'median')
w_stats, p_value =levene(group_1,group_2, center ='mean')

if p_value > alpha :
    print("We do not reject the null hypothesis")
else:
    print("Reject the Null Hypothesis")
print("p_value is = ",p_value)
print("W_stat value is = ",w_stats)

We do not reject the null hypothesis
p_value is =  0.46996219201192246
W_stat value is =  0.5448064536301658

## One Sample Z-Test

In [78]:
from statsmodels.stats.weightstats import ztest as ztest

#enter IQ levels for 20 patients
data = [88, 92, 94, 94, 96, 97, 97, 97, 99, 99,
        105, 109, 109, 109, 110, 112, 112, 113, 114, 115]

#perform one sample z-test
ztest(data, value=100)

(1.5976240527147705, 0.1101266701438426)

## Two Sample Z-Test

In [79]:
from statsmodels.stats.weightstats import ztest as ztest

#enter IQ levels for 20 individuals from each city
cityA = [82, 84, 85, 89, 91, 91, 92, 94, 99, 99,
         105, 109, 109, 109, 110, 112, 112, 113, 114, 114]

cityB = [90, 91, 91, 91, 95, 95, 99, 99, 108, 109,
         109, 114, 115, 116, 117, 117, 128, 129, 130, 133]

#perform two sample z-test
ztest(cityA, cityB, value=0)

(-1.9953236073282115, 0.046007596761332065)

In [80]:
# stats f_oneway functions takes the groups as input and returns ANOVA F and p value
fvalue, pvalue = stats.f_oneway(ship['age'],ship['fare'])
print(fvalue, pvalue)

55.9631014026064 5.646561687729762e-13

## Perform one-way ANOVA

In [82]:
from scipy.stats import f_oneway

var1 = [0.0571, 0.0813, 0.0831, 0.0976, 0.0817, 0.0859, 0.0735,0.0659, 0.0923, 0.0836]

var2 = [0.0873, 0.0662, 0.0672, 0.0819, 0.0749, 0.0649, 0.0835,0.0725]

var3 = [0.0974, 0.1352, 0.0817, 0.1016, 0.0968, 0.1064, 0.105]

var4 = [0.1033, 0.0915, 0.0781, 0.0685, 0.0677, 0.0697, 0.0764,0.0689]

var5 = [0.0703, 0.1026, 0.0956, 0.0973, 0.1039, 0.1045]

f_oneway(var1, var2, var3, var4, var5)

F_onewayResult(statistic=7.121019471642447, pvalue=0.0002812242314534544)

# Two-way ANOVA Test

In [83]:
import numpy as np
import pandas as pd

#create data
df = pd.DataFrame({'water': np.repeat(['daily', 'weekly'], 15),
                   'sun': np.tile(np.repeat(['low', 'med', 'high'], 5), 2),
                   'height': [6, 6, 6, 5, 6, 5, 5, 6, 4, 5,
                              6, 6, 7, 8, 7, 3, 4, 4, 4, 5,
                              4, 4, 4, 4, 4, 5, 6, 6, 7, 8]})

#view first ten rows of data 
df[:10]

   water  sun  height
0  daily  low       6
1  daily  low       6
2  daily  low       6
3  daily  low       5
4  daily  low       6
5  daily  med       5
6  daily  med       5
7  daily  med       6
8  daily  med       4
9  daily  med       5

In [84]:
import statsmodels.api as sm
from statsmodels.formula.api import ols

#perform two-way ANOVA
model = ols('height ~ C(water) + C(sun) + C(water):C(sun)', data=df).fit()
sm.stats.anova_lm(model, typ=2)

                    sum_sq    df        F    PR(>F)
C(water)          8.533333   1.0  16.0000  0.000527
C(sun)           24.866667   2.0  23.3125  0.000002
C(water):C(sun)   2.466667   2.0   2.3125  0.120667
Residual         12.800000  24.0      NaN       NaN

# Tukey’s Test

In [ ]:
import pandas as pd
import numpy as np
from scipy.stats import f_oneway
from statsmodels.stats.multicomp import pairwise_tukeyhsd

In [85]:
#enter data for three groups
a = [85, 86, 88, 75, 78, 94, 98, 79, 71, 80]
b = [91, 92, 93, 90, 97, 94, 82, 88, 95, 96]
c = [79, 78, 88, 94, 92, 85, 83, 85, 82, 81]

#perform one-way ANOVA
f_oneway(a, b, c)

F_onewayResult(statistic=5.167774552944481, pvalue=0.012582197136592609)

In [87]:
import pandas as pd
import numpy as np
from scipy.stats import f_oneway
from statsmodels.stats.multicomp import pairwise_tukeyhsd
#create DataFrame to hold data
df = pd.DataFrame({'score': [85, 86, 88, 75, 78, 94, 98, 79, 71, 80,
                             91, 92, 93, 90, 97, 94, 82, 88, 95, 96,
                             79, 78, 88, 94, 92, 85, 83, 85, 82, 81],
                   'group': np.repeat(['a', 'b', 'c'], repeats=10)}) 

# perform Tukey's test
tukey = pairwise_tukeyhsd(endog=df['score'],
                          groups=df['group'],
                          alpha=0.05)

#display results
print(tukey)

 Multiple Comparison of Means - Tukey HSD, FWER=0.05
=====================================================
group1 group2 meandiff p-adj   lower    upper  reject
-----------------------------------------------------
     a      b      8.4 0.0158   1.4272 15.3728   True
     a      c      1.3 0.8864  -5.6728  8.2728  False
     b      c     -7.1 0.0453 -14.0728 -0.1272   True
-----------------------------------------------------